Tekla Open API Reference for Tekla Structures 2025
GeometrySectionEnumerator.Current Property
 Gets the current geometry section.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GeometrySection Current { get; }
Public ReadOnly Property Current As GeometrySection
	Get
Property Value
Type: GeometrySection
See Also
Reference
GeometrySectionEnumerator Class
Tekla.Structures.Model Namespace